[
  {
    "path": "posts/2021-01-27-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "A makeover of the resident labour force data visualization from the Ministry of Manpower's Labour Force In Singpapore 2019 Report",
    "author": [
      {
        "name": "Bui Anh Hoang",
        "url": {}
      }
    ],
    "date": "2021-01-27",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nCritiques and Suggestions\r\nProposed Design\r\nHow-to GuideButterfly Chart\r\nStacked Bar Chart\r\n\r\nFinal DashboardInsights\r\n\r\n\r\n\r\nbody {\r\ntext-align: justify}\r\nCritiques and Suggestions\r\nOriginal Visualization\r\n\r\n\r\n\r\n#\r\nCritique\r\nSuggestion\r\n\r\nClarity_\r\n\r\n1\r\nThe text is comparing the sum of share of resident labour force of multiple age groups between 2009 and 2019 but those numbers are not highlighted and requires the reader to do the calculations using the data from the table\r\nUse a separate chart for the comparison between 2 years\r\n2\r\nThe median age lines are using the table’s header as a continuous axis while the line chart is using it as a categorical axis, hence the intersections of the lines are incorrectly representing the labour force participation rate of age 41 and 44 in 2009 and 2019, respectively. The text is also not clear if it’s referring to the median age of the labour force or the median age of the population\r\nThe median lines should be removed. Some simple annotation would suffice to state the median age in 2009 and 2019\r\n3\r\nTitle does not represent the message the data visualization tries to convey\r\nRewrite the title to better describe the data visualization\r\n4\r\nThe line graph does not have a Y-axis\r\nAdd a Y-axis and clearly label the ticks with percentage\r\n\r\nAesthetic\r\n\r\n1\r\nThe background color being grey serves no purpose and makes the 2 colors in the visualization less contrasting. These choice of colors would also be indistinguishable if the report is not color printed\r\nUse a white background with a colored border around the visualization if needed\r\n2\r\nTable headers are used as the x-axis of the table which makes the line graph on top looks out of place\r\nUse a separate chart instead\r\n3\r\n“70&Over” is too long for the table cell, making it look crammed\r\n“70+” would be more space efficient while still able to convey the meaning\r\nProposed Design\r\n\r\n\r\n\r\nHow-to Guide\r\nButterfly Chart\r\nCopy the data into a new Excel worksheet as the original file has a lot of formatting.\r\nOpen Tableau and connect to the data in the new Excel worksheet.\r\nHold Ctrl and click on the columns 2009 and 2019.\r\nRight-click on one of the selected columns and select Pivot.\r\n\r\n\r\n\r\nRename the pivoted columns to Year and Labour Force and change the data type of column Year column to Date.\r\n\r\n\r\n\r\nGo to Sheet1 and rename the sheet to 2009.\r\nDrag-and-drop Year and Labour Force to the Columns card and Age to the Rows card.\r\n\r\n\r\n\r\nRight-click on the Year pill to select Filter.\r\n\r\n\r\n\r\nUn-check 2019 from the list and select OK.\r\nRight-click on the Labour Force pill and select Quick Table Calculation > Percentage of Total.\r\n\r\n\r\n\r\nHold Ctrl, drag-and-drop the Labour Force pill from the Columns card to Color in the Marks card.\r\nIn the Marks card, click on Label and select Show marks labels.\r\n\r\n\r\n\r\nRight-click on the X-axis and select Edit Axis:\r\nIn the Range section, select Fixed and set the start and end values to 0 and 0.175, respectively.\r\nIn the Scale section, select Reversed.\r\nSet the title of the axis to 2009.\r\n\r\n\r\n\r\nRight-click on the Age (Years) pill and un-check Show Header.\r\nRight-click on the Year pill and un-check Show Header.\r\n\r\n\r\n\r\nFrom the Toolbar, select Format > Lines:\r\n\r\n\r\n\r\nIn the Columns tab, set Grid Lines to None.\r\n\r\n\r\n\r\nSwitch to the Format Borders tool, under the Sheet tab.\r\nSet Row Divider Pane to None and Column Divider Pane to None.\r\n\r\n\r\n\r\nThe bar chart should looks as below\r\n\r\n\r\n\r\nDuplicate the 2009 sheet and rename it 2019.\r\nRight-click on the Year pill and select Edit Filter then un-check 2009 and check 2019.\r\nRight-click on the X-axis and select Edit Axis:\r\nUn-check Reversed.\r\nRename the axis’ title to 2019.\r\n\r\n\r\n\r\nCreate a new sheet and name it Year.\r\nFrom the Toolbar, select Analysis > Create Calculated Field:\r\n\r\n\r\n\r\nName the calculated field Placeholder for Age.\r\nEnter 0 as the formula.\r\n\r\n\r\n\r\nDrag-and-drop the Placeholder for Age field to the Columns card.\r\nDrag-and-drop the Age (Years) field to the Rows card.\r\n\r\n\r\n\r\nChange the Marks type to Text.\r\nDrag-and-drop the Age (Years) field to Text in the Marks card.\r\n\r\n\r\n\r\nRight-click on both the X-axis and Y-axis and un-check Show Header to hide the axis.\r\nRemove the sheet title.\r\nFrom the Toolbar, select Format > Lines:\r\nOn the Sheet tab, set Axis Rulers to None.\r\nOn the Sheet tab, set Zero Lines to None.\r\nOn the Columns tab, set Grid Lines to None.\r\n\r\n\r\n\r\nReduce the width of the “chart” as much as possible.\r\n\r\n\r\n\r\nCreate a new Dashboard.\r\nArrange the 3 previous created sheets in the Dashboard to achieve the Butterfly Chart.\r\n\r\n\r\n\r\nStacked Bar Chart\r\nCreate a new Sheet called Comparison.\r\nIn the Data pane, right-click on Age (Years) and select Create > Group:\r\n\r\n\r\n\r\nSet the Field Name to Age Group.\r\nUse Shift to select and group all the age groups from 15 to 24 into a group named 15 - 24.\r\nGroup all the age groups from 25 to 54 into a group named 25 - 54.\r\nGroup all rest of the age groups into a group named 55 and over.\r\n\r\n\r\n\r\nDrag-and-drop Year into the Rows card and Labour Force into the Columns card.\r\nRight-click on the Labour Force pill and select Quick Table Calculation > Percentage of Total.\r\n\r\n\r\n\r\nRight-click on the Labour Force pill and select Compute Using > Table (across).\r\nChange the Marks type to Bar.\r\nDrag-and-drop the Age Group group into Color in the Marks card.\r\nDrag-and-drop the Age Group group into Detail in the Marks card.\r\n\r\n\r\n\r\nRight-click on the Age Group pill in the Marks card and select Sort. Choose Descending.\r\nSet the desired colors for the Age Group.\r\n\r\n\r\n\r\nRemove the title and field labels of Year.\r\nArrange the new bar chart into the final dashboard.\r\nFinally, add observations and annotation. Voila!\r\nFinal Dashboard\r\nLink to Tableau Public\r\n\r\n\r\n\r\nInsights\r\nSingapore seems to have an aging workforce as the distribution of the labour force is leaning more towards the older age group in 2019 compare to 2009.\r\nThe distribution of all the age groups from 60 and above has the largest increase in 2019 relative to 2009, indicating that elder people may still have to work instead of retiring.\r\nThe age group which held the largest share in 2009 is 35-39, however, by 2019, the age group with the biggest share has shifted to age group 45-49.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-27-dataviz-makeover-1/images/Original DataViz.PNG",
    "last_modified": "2021-01-28T18:36:49+08:00",
    "input_file": "dataviz-makerover-1.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Awesome",
    "description": "Welcome to our new blog, Awesome. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-04T20:18:44+08:00",
    "input_file": {}
  }
]
